---
kind: property
id: P:Autodesk.Revit.DB.ViewScheduleExportOptions.ColumnHeaders
source: html/85c0ba1a-0300-82bb-29e9-584a3a525d2f.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.ColumnHeaders Property

How to export column headers. Default is MultipleRows.

## Syntax (C#)
```csharp
public ExportColumnHeaders ColumnHeaders { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration